src/ex_Tabakon/Documents/ТБКУценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТБКУценка</Name>
			<Comment>ТБКУценка</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флОтправленВУТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QR_Уценки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБКУценка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") тогда
		Элементы.флОтправленВУТ.Видимость	= Ложь;
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Объект.Магазин) тогда
		Объект.Магазин	=	ОбщегоНазначения.ПолучитьМагазинИзООРП();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() тогда
		Объект.Сформирован					= 	Ложь;
		Объект.Ответственный				=	Неопределено;
	КонецЕсли;
	
	Если Объект.Сформирован тогда 
		ЭтаФорма.ТолькоПросмотр	=	Истина;  	
	КонецЕсли;  
	
	ИспользоватьПодключаемоеОборудование	= Истина;	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
	ОтветственныйБыл		=	Объект.Ответственный;
	Объект.Ответственный	=	Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если Не Отказ И Не Объект.Сформирован Тогда
	//	Сообщить("Не забудьте проставить галочку Сформирован!");		
	//КонецЕсли; 
	
	Если Объект.флОтправленВУТ и Объект.ПометкаУдаления тогда
		Сообщить("Документ отправлен в офис. Удаление невозможно.");	
		Отказ = Истина;
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) и ЗначениеЗаполнено(ОтветственныйБыл) тогда
		Объект.Ответственный	=	ОтветственныйБыл;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформированПриИзменении(Элемент)
	ТекстВопроса = НСтр("ru='Документ Сформирован полностью?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ПроставитьСформирован", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьСформирован(Результат, ДополнительныеПараметры) экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        ЭтаФорма.ТолькоПросмотр	=Истина;
		Записать();
	иначе
		Объект.Сформирован		=	Ложь;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные) 

	Если Объект.Сформирован тогда
		Сообщить("Нельзя добавлять товары в сформированный документ!");
		Возврат;	
	КонецЕсли;
	
	
	Если (Событие = "Штрихкод" Или Событие = "ПолученШтрихкод")  Тогда
		ДанныеСоСканераСтруктура = СобытияФормИСКлиент.ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(
			ЭтотОбъект, 
			Источник, 
			Событие, 
			Данные);
			                               
		Если ДанныеСоСканераСтруктура = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДанныеСоСканераСтруктура.Штрихкод = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ДанныеСоСканераСтруктура.Штрихкод);
		ДанныеСоСканераСтруктура.Штрихкод = СокрЛ(ДанныеСоСканераСтруктура.Штрихкод);
		
		Если Найти(ВРег(ДанныеСоСканераСтруктура.Штрихкод),"FL_") тогда
			
			НаименованиеКод		= Сред(ДанныеСоСканераСтруктура.Штрихкод,4);//отрезаем FL_			
			Объект.Ответственный	= ПроставитьЭкспедитора(НаименованиеКод);
			
			Если Объект.Ответственный.Пустая() тогда
				НаименованиеКод		= Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//отрезаем пароль
				Объект.Ответственный	= ПроставитьЭкспедитора(НаименованиеКод);
			КонецЕсли;
			
			Если Объект.Ответственный.Пустая() тогда
				НаименованиеКод		=   Сред(ДанныеСоСканераСтруктура.Штрихкод,4);
				НаименованиеКод		=	Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//убираем пароль если это новый куар
				Объект.Ответственный	=	ПроставитьЭкспедитора(НаименованиеКод);

				Если Объект.Ответственный.Пустая() тогда
					Сообщить("Не найден админ: " + НаименованиеКод);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
		Иначе    
			Если Объект.Ответственный.Пустая() тогда
				Сообщить("Сначала отсканируйте куар админа!");
				Возврат;
			КонецЕсли;
			
			СканированныйШК	=	ДанныеСоСканераСтруктура.Штрихкод; 
			
			
			УжеЕстьУценка	=	ПроверитьнаПовторноеСканирование(СканированныйШК);  
			Если УжеЕстьУценка <> Неопределено тогда
				Сообщить("Вы уже сканировали этот код в документе: " + УжеЕстьУценка);	
				Возврат;	
			КонецЕсли;
			

			Если СтрЧислоВхождений(СканированныйШК,"/") > 10 тогда //это куар новой уценки
				СканированныйШК	=	ТБК_Шифрование.ПолучитьРасшифрованныйТекст(СканированныйШК,"2","/");
			КонецЕсли;

			Если Найти(СканированныйШК,"UNI_") тогда //Это куар универсальной уценки 
				Ном	=	1;
				Для каждого Строка из Объект.Товары цикл			
					
					Если Строка.QR_Уценки	=	СканированныйШК тогда   
						Сообщить("Вы уже сканировали этот куар уценки в строке: " + Ном); 						
						Возврат;
					КонецЕсли; 
										
					Ном = Ном+1;
				КонецЦикла;
				
				
				Для каждого Строка из Объект.Товары цикл			
					Если Не ЗначениеЗаполнено(Строка.QR_Уценки) тогда 
						Строка.QR_Уценки	=	СканированныйШК;		
					КонецЕсли;
				КонецЦикла;
				
			иначе //это куар номенклатуры        
				Ном	=	1;
				Для каждого Строка из Объект.Товары цикл
					
					Если Не ЗначениеЗаполнено(Строка.QR_Уценки) тогда
						Сообщить("Вы не отсканировали куар уценки в строке: " + Ном); 						
						Возврат;
					КонецЕсли;
					
					Если Строка.QR	=	СканированныйШК тогда   
						Сообщить("Вы уже сканировали этот куар в строке: " + Ном); 						
						Возврат;
					КонецЕсли;     
					
					Ном = Ном+1;
				КонецЦикла;
				
				
				НужнаяНоменклатура = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоКуару(СканированныйШК);  
				
				Если НужнаяНоменклатура = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена номенклатура");	
				    Возврат;
				КонецЕсли;

				
				Если СтрДлина(СканированныйШК) < 20 тогда //это маркировка 						
					
					Если ЭтоМаркированнаяНоменклатура(НужнаяНоменклатура) Тогда 						
						Сообщить("Для этой номенклатуры сканируйте куар код!");
						Возврат;
					КонецЕсли;	
					
				КонецЕсли; 
				
				НужнаяСтрока = Объект.Товары.Добавить();
				НужнаяСтрока.Номенклатура	= НужнаяНоменклатура;
				НужнаяСтрока.QR				= СканированныйШК; 	
			КонецЕсли;
			
		КонецЕсли;     
		
		
		
		
		
	Иначе
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;

КонецПроцедуры    


&НаСервере
Функция ПроставитьЭкспедитора(НаименованиеСпр)
	
	
	//разборНаименования
	НужНаим	=	"";
	Пока НаименованиеСпр <> "" цикл
		Если Лев(НаименованиеСпр,2) = "32" тогда
			НужНаим		=	НужНаим  + " ";	 
			НаименованиеСпр	=	Сред(НаименованиеСпр,3); 
			Продолжить;
		КонецЕсли;
		
		КодСимвола	=	Сред(НаименованиеСпр,1,4);
		НужНаим		=	НужНаим + Символ(КодСимвола);
		
		НаименованиеСпр	=	Сред(НаименованиеСпр,5);
	КонецЦикла;  
	
	Если НужНаим = "" тогда Возврат Неопределено КонецЕсли;
	
	Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию(НужНаим);	
КонецФункции


&НаСервереБезКонтекста
Функция ЭтоМаркированнаяНоменклатура(Номенклатура)
	Возврат ОбщегоНазначения.ЭтоМаркированнаяНоменклатура(Номенклатура); 
КонецФункции

&НаКлиенте
Процедура УдалитьСтрочку(Команда)  
	Если НЕ Объект.Сформирован тогда 
		НомерСтроки = 0;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераСтроки", ЭтотОбъект);
		ПоказатьВводЧисла(Оповещение, 1, "Введите номер удаляемой строки", 10, 0);
	иначе
		Сообщить("Документ уже сформирован, удаление невозможно!");
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция	ПроверитьнаПовторноеСканирование(СканированныйШК)
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ТБКУценкаТовары.Ссылка КАК Ссылка
			      	 	             |ИЗ
			      	 	             |	Документ.ТБКУценка.Товары КАК ТБКУценкаТовары
			      	 	             |ГДЕ
			      	 	             |	(ТБКУценкаТовары.QR ПОДОБНО &QR
			      	 	             |			ИЛИ ТБКУценкаТовары.QR_Уценки ПОДОБНО &QR)
			      	 	             |	И НЕ ТБКУценкаТовары.Ссылка.ПометкаУдаления"); 
	Запрос.УстановитьПараметр("QR", СканированныйШК); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		Возврат Рез.Ссылка;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПослеВводаНомераСтроки(Число, Параметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда  
		Если Число>0 тогда
			Объект.Товары.Удалить(Число-1); 
			Записать();
		КонецЕсли;
	КонецЕсли;      
	
КонецПроцедуры;
